BAS BMEKZU Project/src/Documents/Доверенность/Доверенность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доверенность</name>
  <comment>(Общ)</comment>
  <basedOn>Document.СчетНаОплатуПоставщика</basedOn>
  <basedOn>Document.ВозвратТоваровОтПокупателя</basedOn>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ГТДИмпорт</types>
      <types>DocumentRef.СписаниеСРасчетногоСчета</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДействия</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаПолучениеОт</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДокументу</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийДоверенность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>НаименованиеТовара</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаПоКлассификатору</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/Enums/ВидыОперацийДоверенность/ВидыОперацийДоверенность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийДоверенность</name>
  <enumValues>
    <name>Доверенность</name>
  </enumValues>
  <enumValues>
    <name>ДоверенностьСтрогогоУчета</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Documents/Доверенность/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено
			И ТипДанныхЗаполнения <> Тип("Структура")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	ДатаДействия = Дата + 10 * (24 * 60 * 60);
	ВидОперации = Перечисления.ВидыОперацийДоверенность.Доверенность;	
	УчетДенежныхСредствБП.УстановитьБанковскийСчет(СтруктурнаяЕдиница, Организация, 
		ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());







	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата          = НачалоДня(ОбщегоНазначенияБП.ПолучитьРабочуюДату());
	ДатаДействия  = Дата + 10 * (24 * 60 * 60);
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьПоДокументуОснованию(Основание)
	
	Если    ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика")
		ИЛИ Основание.Метаданные().Имя = "ИНАГРО_СчетНаОплатуПоставщикаБиологическихАктивов" Тогда // ИНАГРО

		Организация        = Основание.Организация;
		ДоговорКонтрагента = Основание.ДоговорКонтрагента;
		Контрагент         = Основание.Контрагент;
		Сделка 			   = Основание;
		ВидОперации		   = Перечисления.ВидыОперацийДоверенность.Доверенность;
		
		НаПолучениеОт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "НаименованиеПолное");
		ПоДокументу = Документы.Доверенность.ПолучитьТекстПоДокументу(Сделка);
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда // ИНАГРО
			ЗаполнитьТоварыПоСчету(Основание);
		Иначе
			ЗаполнитьТоварыПоСчетуБА(Основание);
		КонецЕсли;		

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") 
		  ИЛИ Основание.Метаданные().Имя = "ИНАГРО_ВозвратБиологическихАктивовОтПокупателя" Тогда // ИНАГРО

		Организация        = Основание.Организация;
		ДоговорКонтрагента = Основание.ДоговорКонтрагента;
		Контрагент         = Основание.Контрагент;
		Сделка 			   = Основание;
		ВидОперации		   = Перечисления.ВидыОперацийДоверенность.Доверенность;
		
		НаПолучениеОт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "НаименованиеПолное");
		ПоДокументу = Документы.Доверенность.ПолучитьТекстПоДокументу(Сделка);
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда // ИНАГРО
			ЗаполнитьТоварыПоВозврату(Основание);
		Иначе
			ЗаполнитьТоварыПоВозвратуБА(Основание);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Функция НайтиСоздатьЕдиницу(Код, Наименование, НаименованиеПолное) Экспорт

	ЕдиницаСсылка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(Код);

	Если ЕдиницаСсылка.Пустая() Тогда
		СправочникОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();

		СправочникОбъект.Код                       = Код;
		СправочникОбъект.Наименование              = Наименование;
		СправочникОбъект.НаименованиеПолное        = НаименованиеПолное;

		СправочникОбъект.Записать();

		ЕдиницаСсылка = СправочникОбъект.Ссылка;
	КонецЕсли;

	Возврат ЕдиницаСсылка;

КонецФункции

// Процедура выполняет заполниение табличной части по счету на оплату поставщику.
//
Процедура ЗаполнитьТоварыПоСчету(Основание)

	Товары.Очистить();

	// Оборудование
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Основание", Основание);
    Запрос.УстановитьПараметр("ПустаяЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура                         КАК Номенклатура,
	|	ВЫБОР КОГДА Док.ЕдиницаИзмерения = &ПустаяЕдиницаИзмерения ТОГДА Номенклатура.БазоваяЕдиницаИзмерения ИНАЧЕ ЕдиницаИзмерения КОНЕЦ  КАК Единица,
	|	Док.Количество                           КАК Количество
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.Оборудование КАК Док
	|ГДЕ
	|	Док.Ссылка = &Основание И Док.Количество > 0
	|";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		НаименованиеТовара = Выборка.Номенклатура.НаименованиеПолное;
		НаименованиеТовара = ?(НЕ ЗначениеЗаполнено(НаименованиеТовара), Выборка.Номенклатура.Наименование, НаименованиеТовара);

		СтрокаТабличнойЧасти                         = Товары.Добавить();
		СтрокаТабличнойЧасти.НаименованиеТовара      = НаименованиеТовара;
		СтрокаТабличнойЧасти.Количество              = Выборка.Количество;
		СтрокаТабличнойЧасти.ЕдиницаПоКлассификатору = Выборка.Единица;

	КонецЦикла;

	// Товар
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Основание", Основание);
    Запрос.УстановитьПараметр("ПустаяЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура                         КАК Номенклатура,
	|	ВЫБОР КОГДА Док.ЕдиницаИзмерения = &ПустаяЕдиницаИзмерения ТОГДА Номенклатура.БазоваяЕдиницаИзмерения ИНАЧЕ ЕдиницаИзмерения КОНЕЦ  КАК Единица,
	|	Док.Количество                           КАК Количество
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &Основание И Док.Количество > 0
	|";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		НаименованиеТовара = Выборка.Номенклатура.НаименованиеПолное;
		НаименованиеТовара = ?(НЕ ЗначениеЗаполнено(НаименованиеТовара), Выборка.Номенклатура.Наименование, НаименованиеТовара);

		СтрокаТабличнойЧасти                         = Товары.Добавить();
		СтрокаТабличнойЧасти.НаименованиеТовара      = НаименованиеТовара;
		СтрокаТабличнойЧасти.Количество              = Выборка.Количество;
		СтрокаТабличнойЧасти.ЕдиницаПоКлассификатору = Выборка.Единица;

	КонецЦикла;

	// Возвратная тара
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Основание", Основание);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура                         КАК Номенклатура,
	|	Док.Номенклатура.БазоваяЕдиницаИзмерения КАК Единица,
	|	Док.Количество                           КАК Количество
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.ВозвратнаяТара КАК Док
	|ГДЕ
	|	Док.Ссылка = &Основание И Док.Количество > 0
	|";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.КодЯзыкаИнформационнойБазы();
	Пока Выборка.Следующий() Цикл

		НаименованиеТовара = Выборка.Номенклатура.НаименованиеПолное;
		НаименованиеТовара = ?(НЕ ЗначениеЗаполнено(НаименованиеТовара), Выборка.Номенклатура.Наименование, НаименованиеТовара);

		СтрокаТабличнойЧасти                         = Товары.Добавить();
		СтрокаТабличнойЧасти.НаименованиеТовара      = НаименованиеТовара + НСтр("ru=' (возвратная тара)';uk=' (зворотна тара)'",КодЯзыкаПечать);
		СтрокаТабличнойЧасти.Количество              = Выборка.Количество;
		СтрокаТабличнойЧасти.ЕдиницаПоКлассификатору = Выборка.Единица;

	КонецЦикла;

	// НМА
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("Штука", 	   НайтиСоздатьЕдиницу("2009", "шт", "Штука"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.НематериальныйАктив КАК Номенклатура,
	|	1 						КАК Количество,
	|	&Штука 					КАК Единица
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.НематериальныеАктивы КАК Док
	|ГДЕ
	|	Док.Ссылка = &Основание
	|";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		НаименованиеТовара = Выборка.Номенклатура.НаименованиеПолное;
		НаименованиеТовара = ?(НЕ ЗначениеЗаполнено(НаименованиеТовара), Выборка.Номенклатура.Наименование, НаименованиеТовара);

		СтрокаТабличнойЧасти                         = Товары.Добавить();
		СтрокаТабличнойЧасти.НаименованиеТовара      = НаименованиеТовара;
		СтрокаТабличнойЧасти.Количество              = Выборка.Количество;
		СтрокаТабличнойЧасти.ЕдиницаПоКлассификатору = Выборка.Единица;

	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТоварыПоОстаткам()

// Процедура выполняет заполниение табличной части по возврату товаров от покупателя.
//
Процедура ЗаполнитьТоварыПоВозврату(Основание)

	Товары.Очистить();

	// Товар
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Основание", Основание);
    Запрос.УстановитьПараметр("ПустаяЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура                         КАК Номенклатура,
	|	ВЫБОР КОГДА Док.ЕдиницаИзмерения = &ПустаяЕдиницаИзмерения ТОГДА Номенклатура.БазоваяЕдиницаИзмерения ИНАЧЕ ЕдиницаИзмерения КОНЕЦ  КАК Единица,
	|	Док.Количество                           КАК Количество
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &Основание И Док.Количество > 0
	|";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		НаименованиеТовара = Выборка.Номенклатура.НаименованиеПолное;
		НаименованиеТовара = ?(НЕ ЗначениеЗаполнено(НаименованиеТовара), Выборка.Номенклатура.Наименование, НаименованиеТовара);

		СтрокаТабличнойЧасти                         = Товары.Добавить();
		СтрокаТабличнойЧасти.НаименованиеТовара      = НаименованиеТовара;
		СтрокаТабличнойЧасти.Количество              = Выборка.Количество;
		СтрокаТабличнойЧасти.ЕдиницаПоКлассификатору = Выборка.Единица;

	КонецЦикла;

	// Возвратная тара
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Основание", Основание);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура                         КАК Номенклатура,
	|	Док.Номенклатура.БазоваяЕдиницаИзмерения КАК Единица,
	|	Док.Количество                           КАК Количество
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.ВозвратнаяТара КАК Док
	|ГДЕ
	|	Док.Ссылка = &Основание И Док.Количество > 0
	|";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.КодЯзыкаИнформационнойБазы();
	Пока Выборка.Следующий() Цикл

		НаименованиеТовара = Выборка.Номенклатура.НаименованиеПолное;
		НаименованиеТовара = ?(НЕ ЗначениеЗаполнено(НаименованиеТовара), Выборка.Номенклатура.Наименование, НаименованиеТовара);

		СтрокаТабличнойЧасти                         = Товары.Добавить();
		СтрокаТабличнойЧасти.НаименованиеТовара      = НаименованиеТовара + НСтр("ru=' (возвратная тара)';uk=' (зворотна тара)'",КодЯзыкаПечать);
		СтрокаТабличнойЧасти.Количество              = Выборка.Количество;
		СтрокаТабличнойЧасти.ЕдиницаПоКлассификатору = Выборка.Единица;

	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТоварыПоОстаткам()
  
// Процедура выполняет заполниение табличной части по счету на оплату поставщику.
//
Процедура ЗаполнитьТоварыПоСчетуБА(Основание) // ИНАГРО

	Товары.Очистить();
	
	// Товар
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Основание", Основание);
    Запрос.УстановитьПараметр("ПустаяЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());

	Запрос.Текст =
		"ВЫБРАТЬ
		|	Док.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА Док.ЕдиницаИзмерения = &ПустаяЕдиницаИзмерения
		|			ТОГДА Док.Номенклатура.БазоваяЕдиницаИзмерения
		|		ИНАЧЕ Док.ЕдиницаИзмерения
		|	КОНЕЦ КАК Единица,
		|	Док.Количество КАК Количество
		|ИЗ
		|	Документ.ИНАГРО_СчетНаОплатуПоставщикаБиологическихАктивов.Товары КАК Док
		|ГДЕ
		|	Док.Ссылка = &Основание
		|	И Док.Количество > 0";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		НаименованиеТовара = Выборка.Номенклатура.НаименованиеПолное;
		НаименованиеТовара = ?(НЕ ЗначениеЗаполнено(НаименованиеТовара), Выборка.Номенклатура.Наименование, НаименованиеТовара);

		СтрокаТабличнойЧасти                         = Товары.Добавить();
		СтрокаТабличнойЧасти.НаименованиеТовара      = НаименованиеТовара;
		СтрокаТабличнойЧасти.Количество              = Выборка.Количество;
		СтрокаТабличнойЧасти.ЕдиницаПоКлассификатору = Выборка.Единица;

	КонецЦикла;

	// Возвратная тара
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Основание", Основание);

	Запрос.Текст =
		"ВЫБРАТЬ
		|	Док.Номенклатура КАК Номенклатура,
		|	Док.Номенклатура.БазоваяЕдиницаИзмерения КАК Единица,
		|	Док.Количество КАК Количество
		|ИЗ
		|	Документ.ИНАГРО_СчетНаОплатуПоставщикаБиологическихАктивов.ВозвратнаяТара КАК Док
		|ГДЕ
		|	Док.Ссылка = &Основание
		|	И Док.Количество > 0";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.КодЯзыкаИнформационнойБазы();
	Пока Выборка.Следующий() Цикл

		НаименованиеТовара = Выборка.Номенклатура.НаименованиеПолное;
		НаименованиеТовара = ?(НЕ ЗначениеЗаполнено(НаименованиеТовара), Выборка.Номенклатура.Наименование, НаименованиеТовара);

		СтрокаТабличнойЧасти                         = Товары.Добавить();
		СтрокаТабличнойЧасти.НаименованиеТовара      = НаименованиеТовара + НСтр("ru=' (возвратная тара)';uk=' (зворотна тара)'",КодЯзыкаПечать);
		СтрокаТабличнойЧасти.Количество              = Выборка.Количество;
		СтрокаТабличнойЧасти.ЕдиницаПоКлассификатору = Выборка.Единица;

	КонецЦикла;
		
КонецПроцедуры

// Процедура выполняет заполниение табличной части по возврату БА от покупателя.
//
Процедура ЗаполнитьТоварыПоВозвратуБА(Основание) // ИНАГРО

	Товары.Очистить();

	// БА
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Док.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА Док.ЕдиницаИзмерения = &ПустаяЕдиницаИзмерения
		|			ТОГДА Док.Номенклатура.БазоваяЕдиницаИзмерения
		|		ИНАЧЕ Док.ЕдиницаИзмерения
		|	КОНЕЦ КАК Единица,
		|	Док.Количество КАК Количество
		|ИЗ
		|	Документ.ИНАГРО_ВозвратБиологическихАктивовОтПокупателя.Товары КАК Док
		|ГДЕ
		|	Док.Ссылка = &Основание
		|	И Док.Количество > 0";
	
	Запрос.УстановитьПараметр("Основание",              Основание);
    Запрос.УстановитьПараметр("ПустаяЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		НаименованиеТовара = Выборка.Номенклатура.НаименованиеПолное;
		НаименованиеТовара = ?(НЕ ЗначениеЗаполнено(НаименованиеТовара), Выборка.Номенклатура.Наименование, НаименованиеТовара);

		СтрокаТабличнойЧасти                         = Товары.Добавить();
		СтрокаТабличнойЧасти.НаименованиеТовара      = НаименованиеТовара;
		СтрокаТабличнойЧасти.Количество              = Выборка.Количество;
		СтрокаТабличнойЧасти.ЕдиницаПоКлассификатору = Выборка.Единица;

	КонецЦикла;	
			
КонецПроцедуры

#КонецЕсли
